#!/bin/bash


#===============================================================================
Welcome()
#===============================================================================
{
echo "#################################################################################"
echo "TechTim 채널의 자료가 도움 되신다면 구독과 좋아요 부탁 드립니다"
echo "https://www.youtube.com/@koryechtim"                                           
echo "#################################################################################"
sleep 1
echo 
echo "롱빈터 서버 구축 스크립트를 동작 합니다 "
echo -n "시작 하겠습니까? [yes/no]  "
read -r answer
case $answer in
      (YES|Yes|yes|y)
      break;;
      (NO|No|no|n)
      echo Aborting; exit;;
esac
echo 
echo 
}




#===============================================================================
InstallApps()
#===============================================================================
{
  sudo apt update -y && sleep 1  
  sudo apt install git git-lfs && sleep 1 
  sudo add-apt-repository multiverse && sleep 1
  sudo dpkg --add-architecture i386 && sleep 1
  sudo apt update -y 
  sudo apt install lib32gcc-s1 steamcmd -y 
}
 


#===============================================================================
InstallingSteamSDK()
#===============================================================================
{
  cd ~/
  mkdir steamcmd-source
  cd steamcmd-source
  wget https://steamcdn-a.akamaihd.net/client/installer/steamcmd_linux.tar.gz
  tar -xvzf steamcmd_linux.tar.gz
  ./steamcmd.sh +force_install_dir . +login anonymous +app_update 1007 +quit
}



#===============================================================================
 CopyingSteamSDK()
#===============================================================================
{
cd ~/.steam
mkdir sdk64
cp ~/steamcmd-source/linux64/steamclient.so ~/.steam/sdk64/
}




#===============================================================================
FireWall()
#===============================================================================
{
  sudo iptables -I INPUT -p udp --dport 7777 -j ACCEPT
  sudo iptables -I INPUT -p udp --dport 27016 -j ACCEPT
  sudo iptables -I INPUT -p tcp --dport 27016 -j ACCEPT
  sudo netfilter-persistent save
}



#===============================================================================
FireWall()
#===============================================================================
{
cd ~/
git clone https://github.com/Uuvana-Studios/longvinter-linux-server.git
sudo chmod -R ugo+rwx longvinter-linux-server/
}


#===============================================================================
Customizingtheserver()
#===============================================================================
{
cd ~/
git clone https://github.com/Uuvana-Studios/longvinter-linux-server.git
sudo chmod -R ugo+rwx longvinter-linux-server/
}




# Main Shell Script Start : 

#===============================================================================
# Step1 : Starting and Welcome Message
#===============================================================================
Welcome


#===============================================================================
# Step2 : Verify URL available
#===============================================================================
MODAvailableCheck


#===============================================================================
# Step3 : nstall Essential Utility
#===============================================================================
InstallApps


#===============================================================================
# Step4 : run the forge installer file with the --installServer flag.
#===============================================================================
RunInstaller



#===============================================================================
# Step5 : FirstRun 
#===============================================================================
FirstRun



#===============================================================================
# Step6 : EULA
#===============================================================================
User_Jvm_Args


#===============================================================================
# Step7 : EULA
#===============================================================================
EULA



#===============================================================================
# Step8 : FireWall
#===============================================================================
FireWall


#===============================================================================
# Step9 : Ending Message
#===============================================================================
echo 
echo
echo
echo
echo "========================================================================"
echo "서버 설치가 완료 되었습니다."
echo "서버 실행전 screen 유틸리티를 사용하여 Screen 터미널로 접그 하고"
echo "그 이후 아래 명령어를 실행해서 마인크래프트 서버를 구동 하세요"
echo "========================================================================"
echo "sh ~/run.sh"
echo
echo
  
exit 0
