#!/bin/bash
  

#===============================================================================
Welcome()
#===============================================================================
{
echo "#################################################################################"
echo "TechTim 채널의 자료가 도움 되신다면 구독과 좋아요 부탁 드립니다"
echo "https://www.youtube.com/@kortechtim"                                           
echo "#################################################################################"
sleep 1
echo 
echo "마인크래프트 (MOD)서버 구축 스크립트를 동작 합니다 "
echo -n "시작 하겠습니까? [yes/no]  "
read -r answer
case $answer in
      (YES|Yes|yes|y)
      break;;
      (NO|No|no|n)
      echo Aborting; exit;;
esac

echo 
echo 
echo "https://files.minecraftforge.net/net/minecraftforge/forge"
echo "위 사이트를 참조하여 설치를 원하시는 마인 크래프트의 MOD 버전을 입력해주세요"
echo "버전 정보는 공백이 없어야 합니다. "
echo "올바른 예시 : 1.19.3-44.1.0"
echo "잘못된 예시 : 1.19.3 - 44.1.0 "
read -r MODVersion

echo 
echo 
echo "마인크래프트 모드 서버의 최대 메모리 사이즈를 넣어주세요(MB)"
echo "예시 : 100MB는 100, 1GB는 1024, 2GB는 2048"
read -r MaxMemory
}




#===============================================================================
MODAvailableCheck()
#===============================================================================
{
  cd ~
  mkdir minecraft && cd minecraft
  wget https://maven.minecraftforge.net/net/minecraftforge/forge/${MODVersion}/forge-${MODVersion}-installer.jar
  
  if [ ${?} != "0" ]
  then
    echo "입력하신 버전으로 MOD를 다운로드 할 수 없습니다. 버전정보를 공란 없이 다시 확인하여 주세요"
    exit 1
  fi
}



#===============================================================================
InstallApps()
#===============================================================================
{
  sudo apt update
  sudo apt-get install default-jdk -y
}
 


#===============================================================================
RunInstaller()
#===============================================================================
{
  cd ~/minecraft
  java -jar forge-${MODVersion}-installer.jar --installServer
    
  if [ ${?} != "0" ]
  then
    echo 
    echo 
    echo "============================================================================================"
    echo "현재 MOJANG Server 자체적으로 문제가 있습니다. MOJANG Jar Server와 통신이 원활하지 않습니다."
    echo "이 메시지르 보시 경우 스크립트를 다시 실행 하세요 기존 설치 파일은 자동 삭제 합니다"
    echo "6~7번 정도 실행하면 정상적인 서버와 연결되어 설치 됩니다. 서버가 정상화 되기 전까지 당분간 이렇게 진행해야 합니다"
    echo "============================================================================================"
    echo
    cd ~ && rm -rf ./minecraft
    sleep 2
    exit 1
  fi
}



#===============================================================================
FirstRun()
#===============================================================================
{
  cd ~/minecraft
  java -Xmx${MaxMemory}M -jar forge-${MODVersion}.jar nogui 
}


#===============================================================================
EULA()
#===============================================================================
{
cat <<-EOF > ~/minecraft/eula.txt
eula=true
EOF
}


#===============================================================================
FireWall()
#===============================================================================
{
  sudo iptables -I INPUT -p udp --dport 25565 -j ACCEPT
  sudo iptables -I INPUT -p tcp --dport 25565 -j ACCEPT
  sudo netfilter-persistent save
}



# Main Shell Script Start : 

#===============================================================================
# Step1 : Starting and Welcome Message
#===============================================================================
Welcome


#===============================================================================
# Step2 : Verify URL available
#===============================================================================
MODAvailableCheck


#===============================================================================
# Step3 : nstall Essential Utility
#===============================================================================
InstallApps


#===============================================================================
# Step4 : run the forge installer file with the --installServer flag.
#===============================================================================
RunInstaller



#===============================================================================
# Step5 : FirstRun 
#===============================================================================
FirstRun



#===============================================================================
# Step7 : EULA
#===============================================================================
EULA



#===============================================================================
# Step8 : FireWall
#===============================================================================
FireWall


#===============================================================================
# Step9 : Ending Message
#===============================================================================
echo 
echo
echo
echo
echo "========================================================================"
echo "서버 설치가 완료 되었습니다."
echo "서버 실행전 screen 유틸리티를 사용하여 Screen 터미널로 접근 하고"
echo "그 이후 아래 명령어를 실행해서 마인크래프트 서버를 구동 하세요"
echo "========================================================================"
echo "cd ~/minecraft"
echo "java -Xms${MaxMemory}M -Xmx${MaxMemory}M -jar forge-${MODVersion}.jar nogui"
echo
echo
  
exit 0


